#ifndef LIST_H_
#define LIST_H_

#include <string>
#include <utility>

class list
{
public: //CPokemon에서의 자유로운 접근을 위함
	std::string name[10] = { "피카츄", "이상해꽃", "거북왕", "리자몽", "피죤투", "롱스톤", "버터플", "팬텀", "후딘", "망나뇽" };
	std::string main_type[10] = { "전기", "풀", "물", "불", "노말", "바위", "벌레", "고스트", "에스퍼", "드래곤" };
	std::string sub_type[10] = { " ", "독", " ", "비행", "비행", "땅", "비행", "독", " ", "비행" };
	int hp[10] = { 160, 250, 240, 200, 170, 190, 140, 150, 150, 210 };
	int attack[10] = { 80, 100, 95, 105, 90, 75, 70, 105, 105, 110 };
	int defense[10] = { 70, 110, 90, 70, 60, 100, 50, 55, 55, 85 };
	int speed[10] = { 95, 70, 75, 90, 95, 50, 60, 110, 115, 100 };
	std::pair<std::string, int> skills[13] = { {"전기", 95}, {"풀", 110}, {"물", 120}, {"불", 95}, {"비행", 80}, {"벌레", 75}, {"드래곤", 120}, {"에스퍼", 90}, {"독", 75}, {"고스트", 85}, {"노말", 50}, {"바위", 80}, {"땅", 100} };
	std::string skill_name[13] = { "10만볼트", "솔라빔", "하이드로펌프", "화염방사", "날개치기", "시저크로스", "역린", "사이코키네시스", "크로스포이즌", "섀도우볼", "몸통박치기", "스톤샤워", "지진" };
};

#endif

